package com.example.dbdemo.activity;

//站站查询
public class zzcxActivity {

//（1）站站查询goTozzcxView()
//（2）切换到站站查询界面
//    用setContentView（）
//（3）标示站站查询
//（4）获得查询按钮ID
//（5）返回按钮ID
//（6）发站文本框添加适配器
//（7）为中转站文本框添加适配
//（8）为终点站文本框添加适配器
//（9）中转站CheckBox引用
//（10）为查询按钮添加监听
//（11）获得出发站文本框引用
//（12）获得中转站文本框引用
//（13）获得终点站文本框引用
//（14）由引用获取初始站文本
//（15）由引用获取终点站文本
//（16）由引用获取中转站文本
//（17）声明存放结果集的向量这里可以使用Vector变量
//（18）判断如果需要进行中转站查询则
//（19）调用数据库进行查询
//（20）如果没有查询就通过Toast消息提醒用户
//（21）否则进行不带中转站查询
//（23）调用数据库查询
//（24）如果没有查询就通过Toast消息提醒用户
//（25）如有查询结果则进一步调用查询结果界面用listview展示
//（26）为返回按钮添加监听
//（27）返回主菜单界面

}
